In [14]:
import pandas as pd
d = {'name' : ['George', 'Harry', 'Katy', 'Luna'],
'relationship' : ['Father', 'Son', 'Mother', 'Daughter'],
'BirthYear' : [1980, 2010, 1982, 2014]}

df = pd.DataFrame(d)
df.head()

     name relationship  BirthYear
0  George       Father       1980
1   Harry          Son       2010
2    Katy       Mother       1982
3    Luna     Daughter       2014

* Q1. create a new column age(refrence from today 2024)

In [10]:
df['BirthYear'].name

'BirthYear'

In [11]:
df['age'] = df['BirthYear'].apply(lambda x: 2024-x )

In [12]:
df

     name relationship  BirthYear  age
0  George       Father       1980   44
1   Harry          Son       2010   14
2    Katy       Mother       1982   42
3    Luna     Daughter       2014   10

In [15]:
df.assign(age=lambda df: 2024- df['BirthYear'],)

     name relationship  BirthYear  age
0  George       Father       1980   44
1   Harry          Son       2010   14
2    Katy       Mother       1982   42
3    Luna     Daughter       2014   10

In [18]:
df.assign(age= 2024 - df['BirthYear'], age_at_2018_world_cup = 2018 - df['BirthYear'])

     name relationship  BirthYear  age  age_at_2018_world_cup
0  George       Father       1980   44                     38
1   Harry          Son       2010   14                      8
2    Katy       Mother       1982   42                     36
3    Luna     Daughter       2014   10                      4